app/controllers/cost_controller.rb

  def index

  	require 'dijkstraclass'

    r = Shipping.pluck(:origin,:destination, :distance)
---
SELECT "shippings"."origin", "shippings"."destination", "shippings"."distance" FROM "shippings"