app/controllers/destinations_controller.rb

  def index
    @destinations = Destination.all
---
SELECT "destinations".* FROM "destinations"