app/controllers/shippings_controller.rb

SELECT "shippings".* FROM "shippings"
---
  def index
    @shippings = Shipping.all

SELECT "shippings".* FROM "shippings" WHERE "shippings"."origin" = ? AND "shippings"."destination" = ?  [["origin", "D"], ["destination", "Z"]]
SELECT "shippings".* FROM "shippings" WHERE "shippings"."origin" = ? AND "shippings"."destination" = ?  [["origin", "D"], ["destination", "X"]]
SELECT  "shippings".* FROM "shippings" WHERE "shippings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "shippings" SET "distance" = ?, "updated_at" = ? WHERE "shippings"."id" = ?  [["distance", 27], ["updated_at", "2018-03-17 19:55:51.878712"], ["id", 1]]
UPDATE "shippings" SET "distance" = ?, "updated_at" = ? WHERE "shippings"."id" = ?  [["distance", 25], ["updated_at", "2018-03-17 19:38:04.899392"], ["id", 1]]
INSERT INTO "shippings" ("origin", "destination", "distance", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["origin", "D"], ["destination", "X"], ["distance", 25], ["created_at", "2018-03-17 20:07:08.381885"], ["updated_at", "2018-03-17 20:07:08.381885"]]
---
  def create
    @shipping = Shipping.new(shipping_params)

    existValue = Shipping.where(origin: @shipping.origin, destination: @shipping.destination)


  if existValue.length > 0

    @shipping.id = existValue[0].id
    updatevalue = Shipping.find(existValue[0].id)

    if updatevalue.update(distance:@shipping.distance, updated_at: Time.now)
      #render json: @shipping, status: :created, location: @shipping
      render :json => { json: @shipping, status: :created, location: existValue }, :status => 200
    else
      render json: @shipping.errors, status: :unprocessable_entity
    end

  else
    if @shipping.save

UPDATE "shippings" SET "origin" = ?, "destination" = ?, "distance" = ?, "updated_at" = ? WHERE "shippings"."id" = ?  [["origin", "D"], ["destination", "M"], ["distance", 20], ["updated_at", "2018-03-17 18:00:10.173421"], ["id", 1]]
---
  def update
    if @shipping.update(shipping_params)

SELECT  "shippings".* FROM "shippings" WHERE "shippings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_shipping
      @shipping = Shipping.find(params[:id])